<template>
    <InstructionCont 
        :instr_tabs="instr_tabs"
        text="По применению",
        title="Инструкция"
    />
</template>

<script setup>
const instr_tabs = ref([
    {
        id: 'tablet',
        label: 'Таблетки',
        link: {
            href: '',
            text: 'Регистрация препарата'
        },
        content: `
            <div>
                <p>
                    <strong>
                        Регистрационный номер: 
                    </strong>
                </p>
                <p>
                    <strong>
                        Торговое наименование:
                    </strong>
                    Глутаргин алкоклин 
                </p>
                <p>
                    <strong>
                        Международное непатентованное или группировочное наименование:
                    </strong>
                    аргинина  глутамат 
                </p>
                <p>
                    <strong>
                        Лекарственная форма:
                    </strong>
                    таблетки
                </p>
                <p>
                    <strong>
                        Состав:
                    </strong>
                </p>
                <p>
                    1 таблетка содержит:
                </p>
                <p>
                    Действующее вещество: аргинина глутамат - 1,000 г. 
                </p>
                <p>
                    Вспомогательные вещества: целлюлоза микрокристаллическая 101 - 0,110 г, кросповидон  тип А - 0,020 г, магния стеарат - 0,010 г. 
                </p>
                <p>
                    <strong>
                        Описание:
                    </strong>
                    таблетки белого цвета, двояковыпуклые, продолговатой формы.
                </p>
            </div>
            <div>
                <p><strong>Фармакотерапевтическая группа:</strong> средства для лечения заболеваний печени.</p>
                <p><strong>Код АТХ:</strong> А05ВА01</p>
            </div>
            <div>
                <p><strong>Фармакологические свойства</strong></p>
                <p><strong>Фармакодинамика </strong> Аргинина глутамат является соединением аргинина и глутаминовой кислоты, которые  играют важную роль в обеспечении биохимических процессов нейтрализации и  выведения из организма высокотоксичного метаболита обмена азотистых веществ -  аммиака.  Оказывает гепатопротекторное действие, обладая антиоксидантной,  антигипоксической и мембраностабилизирующей активностью, позитивно влияет на  процессы энергообеспечения в гепатоцитах.  При алкогольной интоксикации аргинина глутамат стимулирует утилизацию алкоголя в  монооксигеназной системе печени, предупреждает угнетение ключевого фермента  утилизации этанола - алкогольдегидрогеназы; ускоряет инактивацию и выведение  токсических продуктов метаболизма этанола в результате увеличения образования и  окисления янтарной кислоты; снижает угнетающее влияние алкоголя на центральную  нервную систему (ЦНС) за счет нейромедиаторных свойств возбуждающей глутаминовой кислоты.</p>
            </div>
            <div>
                <p>Аргинина глутамат не оказывает эмбриотоксических, гонадотоксических и мутагенных  эффектов, не вызывает аллергических и иммунотоксических реакций.</p>
                <p>Фармакокинетика</p>
                <p>Не изучалась.</p>
                <p>Показания к применению  Уменьшение симптомов алкогольного опьянения и абстинентного состояния, в том  числе в профилактических целях.    Профилактика гепатотоксического действия алкоголя.</p>
            </div>
            <div>
                <p><strong>Противопоказания</strong></p>
                <p>гиперчувствительность к компонентам препарата;</p>
                <p>детский возраст до 18 лет;</p>
                <p>период беременности и кормления грудью.</p>
                <p>С осторожностью</p>
                <p>лихорадочное состояние;</p>
                <p>повышенная возбудимость;</p>
                <p>тяжелые нарушения фильтрационной (азотовыделительной) функции почек (клиренс  креатинина менее 30 мл/мин).</p>
                <p><strong>Применение при беременности и в период грудного вскармливания</strong></p>
                <p>Применение препарата Глутаргин алкоклин противопоказано во время беременности и в  период грудного вскармливания.</p>
            </div>
            <div>
                <p><strong>Способ применения и дозы</strong></p>
                <p>Препарат назначают взрослым внутрь независимо от приема пищи.  Для профилактики опьянения и гепатотоксического действия алкоголя назначают по   2 таблетки (2 г) за 1-2 ч до приема алкоголя или 1 таблетку (1 г) за 1 ч до приема алкоголя  и 1 таблетку (1 г) в течение 0,5 ч после приема алкоголя.</p>
                <p><strong>Побочное действие</strong></p>
                <p>Редко могут наблюдаться чувство легкого дискомфорта в эпигастральной области и  тошнота  непосредственно  после применения препарата, которые проходят  2  самостоятельно.</p>
                <p>Передозировка</p>
                <p>Симптомы</p>
                <p>Тошнота, рвота, боль в области грудной клетки, чувство дискомфорта в эпигастральной  области, бессонница, преходящее кратковременное снижение артериального давления,  атриовентрикулярная блокада, аллергические реакции.</p>
                <p>Лечение</p>
                <p>Лечение симптоматическое, при необходимости прием антигистаминных средств, в  тяжелых случаях - внутривенное введение глюкокортикостероидов.</p>
            </div>
            <div>
                <p><strong>Взаимодействие с другими лекарственными средствами</strong></p>
                <p>Следует соблюдать осторожность при сочетании препарата Глутаргин алкоклин со  следующими лекарственными средствами:</p>
                <p>Аминофиллин повышает концентрацию эндогенного инсулина в крови под влиянием  препарата Глутаргин алкоклин.</p>
                <p>Препарат Глутаргин алкоклин может усиливать эффект антиагрегантных средств  (дипиридамол и др.), предупреждает и ослабляет нейротоксические явления, которые  могут возникать при терапии изониазидом, ослабляет эффект винбластина.</p>
                <p><strong>Особые указания</strong></p>
                <p>При назначении пациентам с нарушениями функций эндокринных желез следует  учитывать, что препарат может незначительно увеличивать секрецию инсулина и гормона  роста, что не требует коррекции медикаментозной терапии у пациентов с сахарным  диабетом и/или акромегалией.</p>
                <p>Влияние на способность управлять транспортными средствами, механизмами</p>
                <p>Препарат не влияет на способность управления транспортными средствами.</p>
            </div>
            <div>
                <p><strong>Форма выпуска</strong></p>
                <p>Таблетки, 1 г.</p>
                <p>По 2 или 10 таблеток в контурной ячейковой упаковке из пленки поливинилхлоридной и  фольги алюминиевой, или по 10 таблеток во флаконе полимерном (из полиэтилена  низкого давления) с натяжной крышкой с уплотняющим элементом (из полиэтилена  высокого давления) и контролем первого вскрытия.  3  1 контурная ячейковая упаковка по 2 таблетки или 1 контурная ячейковая упаковка по 10  таблеток, или 1 флакон вместе с инструкцией по применению в пачке из картона.</p>
                <p><strong>Условия хранения</strong></p>
                <p>Хранить при температуре не выше 25°С в оригинальной упаковке.  Хранить в недоступном для детей месте.</p>
                <p><strong>Срок годности</strong></p>
                <p>3 года.</p>
                <p>Не применять по истечении срока годности.</p>
                <p><strong>Условия отпуска</strong></p>
                <p>Отпускают без рецепта.</p>
            </div>
            <div>
                <p><strong>Держатель регистрационного удостоверения</strong></p>
                <p>ООО «АТРАПАК»  Россия, 115280, г. Москва, вн.тер.г. муниципальный округ Даниловский, ул. Ленинская  Слобода, д. 26, этаж – 3, помещ./ком. IV/145</p>
                <p><strong>Производитель</strong></p>
                <p>ООО «Фармамед»  Россия, г. Санкт-Петербург, вн.тер.г. муниципальный округ Сергиевское, ул.  Домостроительная, д. 16, лит. Е</p>
                <p><strong>Организация, принимающая претензии потребителей</strong></p>
                <p>ООО «ЭЮЦ Клиник»  Россия, 109147, г. Москва, ул. Таганская, дом 3, эт/пом/ком 5/1/4</p>
                <p>Тел: +7 (495) 477-55-60</p>
                <p>E-mail: pvchief@bloft.ru</p>
            </div>
        `
    },
    {
        id: 'powder',
        label: 'Порошок',
        link: {
            href: '',
            text: 'Регистрация препарата'
        },
        content: `
            <div>
                <p><strong>Регистрационный номер:</strong> на регистрации</p>

                <p><strong>Торговое наименование:</strong> Глутаргин алкоклин</p>

                <p><strong>Международное непатентованное или группировочное название:</strong> аргинина глутамат</p>

                <p><strong>Лекарственная форма:</strong> порошок для приготовления раствора для приема внутрь</p>

                <p><strong>Состав:</strong></p>
                <p>Состав одного пакета:</p>
                <p>Действующее вещество: аргинина глутамат (в пересчете на 100% вещество) – 1,00 г;</p>
                <p>Вспомогательные вещества: глицин – 0,50 г, маннитол (Е421) – 0,79 г, лимонная кислота (безводная) – 0,60 г, аспартам (Е951) – 0,06 г, ароматизатор лимонный – 0,05 г.</p>

                <p><strong>Описание:</strong> порошок от белого до белого с желтоватым оттенком, с фруктовым запахом.</p>
            </div>

            <div>
                <p><strong>Фармакотерапевтическая группа:</strong> гепатопротекторное средство.</p>
                <p><strong>Код АТХ:</strong> А05ВА01</p>
                <p><strong>ФАРМАКОЛОГИЧЕСКИЕ СВОЙСТВА</strong></p>

                <p><strong>Фармакодинамика.</strong>  
                Глутаргин алкоклин является соединением аргинина и глутаминовой кислоты, которые играют важную роль в обеспечении биохимических процессов нейтрализации и выведения из организма высокотоксичного метаболита аммиака.
                Оказывает гепатопротекторное действие, обладая антиоксидантной, антигипоксической и мембраностабилизирующей активностью.
                Позитивно влияет на процессы энергообеспечения в гепатоцитах.</p>

                <p>При алкогольной интоксикации препарат ускоряет утилизацию алкоголя, предупреждает угнетение алкогольдегидрогеназы, усиливает инактивацию токсичных продуктов этанола, снижает угнетающее влияние алкоголя на ЦНС.</p>

                <p>Не оказывает эмбриотоксических, мутагенных, гонадотоксических эффектов, не вызывает аллергических реакций.</p>

                <p><strong>Фармакокинетика:</strong> не изучалась.</p>
            </div>

            <div>
                <p><strong>Показания к применению:</strong></p>
                <p>— Профилактика опьянения и гепатотоксического действия алкоголя;</p>
                <p>— Лечение острой алкогольной интоксикации лёгкой и средней степени;</p>
                <p>— В составе комплексной терапии постинтоксикационных нарушений после тяжёлого алкогольного отравления.</p>
            </div>

            <div>
                <p><strong>Противопоказания:</strong></p>
                <p>— Повышенная чувствительность;</p>
                <p>— Детский возраст до 18 лет;</p>
                <p>— Беременность и грудное вскармливание;</p>
                <p>— Фенилкетонурия (препарат содержит аспартам).</p>

                <p><strong>С осторожностью:</strong></p>
                <p>Лихорадка, повышенная возбудимость, тяжёлые нарушения азотовыделительной функции почек (клиренс креатинина &lt; 30 мл/мин).</p>
            </div>

            <div>
                <p><strong>Способ применения и дозы:</strong></p>
                <p>Взрослым внутрь, независимо от приёма пищи, растворив пакет в 1/4–1/2 стакана воды.</p>

                <p><strong>Для профилактики:</strong>  
                2 пакета (2 г) за 1–2 часа до алкоголя  
                или  
                1 пакет до и 1 пакет после алкоголя.</p>

                <p><strong>При интоксикации лёгкой/средней степени:</strong>  
                по 1 пакету 4 раза в день.</p>

                <p><strong>При тяжёлой интоксикации:</strong>  
                по 1 пакету 2 раза в сутки 20 дней после курса внутривенного Глутаргина.</p>
            </div>

            <div>
                <p><strong>Побочные действия:</strong></p>
                <p>Редко: тошнота, лёгкий дискомфорт в эпигастрии.</p>

                <p><strong>Передозировка:</strong></p>
                <p>Тошнота, рвота, боль в груди, бессонница, снижение АД, аллергические реакции.</p>
            </div>

            <div>
                <p><strong>Взаимодействия:</strong></p>
                <p>— Аминофиллин повышает концентрацию инсулина;</p>
                <p>— Усиливает действие антиагрегантов;</p>
                <p>— Ослабляет нейротоксичность изониазида;</p>
                <p>— Ослабляет эффект винбластина.</p>
            </div>

            <div>
                <p><strong>Особые указания:</strong></p>
                <p>Может незначительно увеличивать секрецию инсулина и гормона роста (несущественно для диабета и акромегалии).</p>

                <p><strong>Влияние на управление транспортом:</strong> не влияет.</p>
            </div>

            <div>
                <p><strong>Форма выпуска:</strong></p>
                <p>Порошок 1 г в пакетах (№1 и №2).</p>
            </div>

            <div>
                <p><strong>Условия хранения:</strong> при t ≤ 25°С, в оригинальной упаковке, вдали от детей.</p>

                <p><strong>Срок годности:</strong> 2 года. Не использовать по истечении срока.</p>

                <p><strong>Условия отпуска:</strong> без рецепта.</p>
            </div>

            <div>
                <p><strong>Держатель регистрационного удостоверения:</strong></p>
                <p>ООО «АТРАПАК», Россия, Москва, ул. Ленинская Слобода, д.26</p>

                <p><strong>Производитель:</strong></p>
                <p>ООО «ЭСКО-ФАРМ», Республика Армения, Ереван</p>

                <p><strong>Организация для претензий:</strong></p>
                <p>ООО «Экспертно-юридический центр», Москва</p>
                <p>Тел.: +7 (495) 477-55-60</p>
                <p>Email: pvchief@bloft.ru</p>
            </div>

        `
    },
])

// Родитель хранит активную вкладку
const activeTab = ref('tablet')
</script>

<style scoped>

</style>