<template>
    <QstBanner title="Вопрос - ответ" text="Часто встречающиееся вопросы и ответы нашихспециалистов. Если вы не нашлли ответ, задйте нам вопрос через форму обратной связи"/>
    <MainArticle :articles="articles" title="Часто встречающиеся вопросы" :more="false" route="qsts"/>
    <MainQst />
</template>

<script setup>
    const articles = await useQsts()

    // const articles = ref([
    //     {
    //         num: '01',
    //         pic: '/images/main-article/pic.png',
    //         title: 'Что такое глутаргин алкоклин?',
    //         text: 'Накануне осени выбрали для вас витамины, которые помогут укрепить иммунитет и сохранить ваше здоровье в сезон прохладной погоды.',
    //         link: {
    //             href: '',
    //             text: 'Подробнее'
    //         }
    //     },
    //     {
    //         num: '02',
    //         pic: '/images/main-article/pic.png',
    //         title: 'КАКИЕ АКТИВНЫЕ КОМПОНЕНТЫ ВХОДЯТ В СОСТАВ?',
    //         text: 'Накануне осени выбрали для вас витамины, которые помогут укрепить иммунитет и сохранить ваше здоровье в сезон прохладной погоды.',
    //         link: {
    //             href: '',
    //             text: 'Подробнее'
    //         }
    //     },
    //     {
    //         num: '03',
    //         pic: '/images/main-article/pic.png',
    //         title: 'КАКОВЫ ПРЕИМУЩЕСТВА глутаргин алкоклин?',
    //         text: 'Накануне осени выбрали для вас витамины, которые помогут укрепить иммунитет и сохранить ваше здоровье в сезон прохладной погоды.',
    //         link: {
    //             href: '',
    //             text: 'Подробнее'
    //         }
    //     },
    //     {
    //         num: '04',
    //         pic: '/images/main-article/pic.png',
    //         title: 'КАК СЛЕДУЕТ ПРИНИМАТЬ глутаргин алкоклин? ',
    //         text: 'Накануне осени выбрали для вас витамины, которые помогут укрепить иммунитет и сохранить ваше здоровье в сезон прохладной погоды.',
    //         link: {
    //             href: '',
    //             text: 'Подробнее'
    //         }
    //     },
    //     {
    //         num: '05',
    //         pic: '/images/main-article/pic.png',
    //         title: 'Когда эффективен препарат?',
    //         text: 'Накануне осени выбрали для вас витамины, которые помогут укрепить иммунитет и сохранить ваше здоровье в сезон прохладной погоды.',
    //         link: {
    //             href: '',
    //             text: 'Подробнее'
    //         }
    //     },
    // ]);
</script>

<style scoped>

</style>